Revit 2027 API
MEPBuildingConstructionSet.ForwardIterator Method
Retrieve a forward moving iterator to the set.
Namespace: Autodesk.Revit.DB.Mechanical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public virtual MEPBuildingConstructionSetIterator ForwardIterator()
Public Overridable Function ForwardIterator As MEPBuildingConstructionSetIterator
public:
virtual MEPBuildingConstructionSetIterator^ ForwardIterator()
abstract ForwardIterator : unit -> MEPBuildingConstructionSetIterator
override ForwardIterator : unit -> MEPBuildingConstructionSetIterator
Return Value
MEPBuildingConstructionSetIterator
Returns a forward moving iterator to the set.
See Also
Reference
MEPBuildingConstructionSet Class
Autodesk.Revit.DB.Mechanical Namespace